package game;

public class Help {

    public static final String help = "Справка по игре \"Котоквест\".\n\n" +
            "Меню - здесь ты можешь начать новую игру, сохранить текущую игру, загрузить ранее сохранённую игру, а также в любой момент игры открыть данную справку. " +
            "Кнопка выход завершает игру и закрывает игровое окно (с сохранением текущего прогресса).\n\n" +
            "Основное окно.\n\n" +
            "Левая часть.\n" +
            "Здесь отображаются характеристики твоего кошака: здоровье, сила, защита и уровень, а также количество еды и валерьянки.\n\n" +
            "Средняя часть.\n" +
            "Здесь выводится вся основная текстовая информация в процессе игры.\n\n" +
            "Правая часть.\n" +
            "Здесь выводится краткая информация о ближайшем боссе. Информация выводится только после успешно проведённой разведки.\n\n" +
            "В нижней части окна расположены основные игровые кнопки.\n\n" +
            "Назначения кнопок:\n\n" +
            "Охота.\n" +
            "Твой кошак отправляется на охоту. Охота служит в первую очередь для прокачки кошака, увеличения его уровня и остальных параметров. " +
            "Кроме того, существует шанс найти еду или валерьянку. Охота может окончиться неудачей, в таком случае просто повтори попытку.\n\n" +
            "Кормить.\n" +
            "Данная кнопка позволяет накормить кошака, восстановив ему немного здоровья.\n\n" +
            "Валерьянка.\n" +
            "Кнопка позволяет применить валерьянку - чудодейственное средство, способное вызвать различные эффекты. Какие - увидишь сам.\n\n" +
            "Разведка.\n" +
            "Позволяет узнать краткие характеристики босса. Существует высокий шанс провала разведки.\n\n" +
            "Атака босса.\n" +
            "Твой кошак атакует босса. Перед атакой рекомендуется провести разведку, чтобы иметь примерное представление о силе босса.\n\n" +
            "Тырить колбасу - основная цель игры. Делать это следует, когда побеждены все боссы. Если хотя бы один босс не побеждён - шансы спереть " +
            "колбасу крайне малы. Не рекомендуется пытаться выиграть таким способом.\n\n" +
            "Приятной игры!";
}
